#include "evt.h"
#include "evt_functions.h"

void btlevtcmd_get_turn(void);
void evt_eff64(void);
void btlevtcmd_SetUnitWork(void);
void btlevtcmd_AnimeChangePoseFromTable(void);
void btlevtcmd_check_battleflag(void);
void btlevtcmd_GetFirstAttackTarget(void);
void btlevtcmd_GetEnemyBelong(void);
void btlevtcmd_SamplingEnemy(void);
void btlevtcmd_ChoiceSamplingEnemy(void);
void btlevtcmd_CheckToken(void);
void btlevtcmd_EnemyItemUseCheck(void);
void btlevtcmd_StartWaitEvent(void);
void btlevtcmd_RunDataEventChild(void);
void evt_btl_camera_set_homing_unitparts(void);
void evt_sub_random(void);
void btlevtcmd_DrawLots(void);
void btlevtcmd_JumpSetting(void);
void evt_btl_camera_set_mode(void);
void evt_btl_camera_set_homing_unit(void);
void evt_btl_camera_set_moveSpeedLv(void);
void evt_btl_camera_set_zoom(void);
void btlevtcmd_WeaponAftereffect(void);
void btlevtcmd_AttackDeclare(void);
void btlevtcmd_WaitGuardMove(void);
void btlevtcmd_PayWeaponCost(void);
void btlevtcmd_AnimeChangePoseType(void);
void btlevtcmd_GetPos(void);
void btlevtcmd_FaceDirectionAdd(void);
void btlevtcmd_CalculateFaceDirection(void);
void btlevtcmd_ChangeFaceDirection(void);
void btlevtcmd_SetMoveSpeed(void);
void btlevtcmd_MovePosition(void);
void btlevtcmd_AnimeChangePoseType(void);
void btlevtcmd_CalculateFaceDirection(void);
void btlevtcmd_ChangeFaceDirection(void);
void evt_btl_camera_nomove_y_onoff(void);
void btlevtcmd_GetPosFloat(void);
void krb_get_dir(void);

void btlevtcmd_AnimeChangePose(void);
void btlevtcmd_GetUnitWork(void);
extern void btlevtcmd_CheckDamage(void);
extern void btlevtcmd_FaceDirectionSub(void);
extern void btlevtcmd_GetHitPos(void);
extern void btlevtcmd_GetHomePos(void);
extern void btlevtcmd_JumpContinue(void);
extern void btlevtcmd_JumpPosition(void);
extern void btlevtcmd_MoveDirectionAdd(void);
extern void btlevtcmd_PreCheckDamage(void);
extern void btlevtcmd_ResetFaceDirection(void);
extern void btlevtcmd_ResultACDefence(void);
extern void btlevtcmd_SetMoveSoundDataWork(void);
extern void btlevtcmd_StartAvoid(void);
extern void btlevtcmd_snd_se(void);
extern void evt_btl_camera_add_zoom(void);
extern void evt_btl_camera_shake_h(void);
extern void btlevtcmd_SetEventAttack(void);
extern void btlevtcmd_SetEventConfusion(void);
extern void btlevtcmd_SetEventDamage(void);
extern void btlevtcmd_SetEventWait(void);
extern void btlevtcmd_SetJumpSound(void);
extern void btlevtcmd_SetRunSound(void);
extern void btlevtcmd_SetWalkSound(void);
void btlevtcmd_GetSelectEnemy(void);
void btlevtcmd_CommandGetWeaponAddress(void);
void btlevtcmd_CommandPayWeaponCost(void);
void btlevtcmd_AcGetDifficulty(void);
void btlevtcmd_AcSetParamAll(void);
void btlevtcmd_AcSetFlag(void);
void btlevtcmd_GetStatusMg(void);
void btlevtcmd_GetHeight(void);
void btlevtcmd_GetBodyId(void);
void btlevtcmd_AnimeChangePose(void);  // already declared, skip
void btlevtcmd_ftof(void);
void btlevtcmd_WaitEventEnd(void);
void btlevtcmd_AnnounceMessage(void);
void evt_eff(void);
void evt_snd_sfxon_3d(void);
void evt_audience_acrobat_notry(void);
void _set_hustle(void);

// AC/audience functions (kept from Goombella)
extern void btlevtcmd_AcSetDifficulty(void);
extern void btlevtcmd_SetupAC(void);
extern void btlevtcmd_StartAC(void);
extern void btlevtcmd_StopAC(void);
extern void btlevtcmd_ResultAC(void);
extern void btlevtcmd_GetResultAC(void);
extern void btlevtcmd_GetResultCountAC(void);
extern void btlevtcmd_ACRStart(void);
extern void btlevtcmd_ACRGetResult(void);
extern void btlevtcmd_AudienceDeclareACResult(void);
extern void btlevtcmd_AudienceDeclareAcrobatResult(void);
extern void btlevtcmd_ACSuccessEffect(void);
extern void btlevtcmd_ac_timing_flag_onoff(void);
extern void btlevtcmd_ac_timing_get_success_frame(void);
extern void btlevtcmd_GetResultPrizeLv(void);
extern void btlevtcmd_InviteApInfoReport(void);
extern void btlevtcmd_SetScale(void);
extern void btlevtcmd_SetFallAccel(void);
extern void btlevtcmd_GetFaceDirection(void);
extern void btlevtcmd_AddRotate(void);
extern void btlevtcmd_GetRotate(void);
extern void btlevtcmd_SetRotateOffset(void);
extern void btlevtcmd_MarioJumpPosition(void);
extern void btlevtcmd_MarioJumpParam(void);
extern void btlevtcmd_GetTakeoffPosition(void);
extern void btlevtcmd_GetMoveFrame(void);
extern void btlevtcmd_CommandGetWeaponActionLv(void);
extern void evt_audience_ap_recovery(void);
 
extern EvtScript btldefaultevt_Damage;
extern EvtScript subsetevt_confuse_flustered;

typedef struct DataTable {
    s32 unk_00;
    void* unk_04;
    s32 unk_08;
    s32 unk_0C;
} DataTable; //sizeof 0x10

typedef struct PoseTable {
    s32 poseID;
    char* poseStr;
} PoseTable;

u8 defence[] = {0, 0, 0, 0, 0, 0, 0, 0}; //unsure on length
u8 defence_attr[] = {0, 0, 0, 0, 0, 0, 0, 0}; //unsure on length

extern EvtScript btldefaultevt_Dummy;

//?
DataTable data_table = {
    0x30,
    btldefaultevt_Dummy,
    0,
    0
};

static PoseTable pose_table[] = {
    {0x00000001, "KUR_N_1"},
    {0x00000002, "KUR_Y_1"},
    {0x00000009, "KUR_Y_1"},
    {0x00000005, "KUR_K_1"},
    {0x00000004, "KUR_I_1"},
    {0x00000003, "KUR_I_1"},
    {0x0000001C, "KUR_S_1"},
    {0x0000001D, "KUR_Q_1"},
    {0x0000001E, "KUR_Q_1"},
    {0x0000001F, "KUR_S_1"},
    {0x00000027, "KUR_D_1"},
    {0x00000032, "KUR_A_1"},
    {0x00000033, "KUR_A_2"},
    {0x0000002A, "KUR_R_1"},
    {0x00000029, "KUR_R_2"},
    {0x00000028, "KUR_W_1"},
    {0x00000038, "KUR_I_1"},
    {0x00000039, "KUR_I_1"},
    {0x00000041, "KUR_T_1"},
    {0x00000045, "KUR_S_1"},
};


typedef struct ActorPartBlueprint {
/* 0x00 */ s32 partsTotal;
/* 0x04 */ char* unk_04; //btl name?
/* 0x08 */ char* unk_08; //file to load for Actor
/* 0x0C */ s32 unk_0C;
/* 0x10 */ s32 unk_10;
/* 0x14 */ s32 unk_14;
/* 0x18 */ s32 unk_18;
/* 0x1C */ f32 unk_1C;
/* 0x20 */ f32 unk_20; //is this actually a float?
/* 0x24 */ f32 unk_24; //is this actually a float?
/* 0x28 */ f32 unk_28;
/* 0x2C */ char unk_2C[4]; //posOffset from pm64?
/* 0x30 */ s16 targetOffset[2]; //targetOffset from pm64?
/* 0x34 */ s16 opacity; //why is this s16?
/* 0x36 */ char unk_36[2]; //probably padding
/* 0x38 */ u8* defenseTable;
/* 0x3C */ u8* defenseAttr;
/* 0x40 */ s32 unk_40;
/* 0x44 */ s32 unk_44;
/* 0x48 */ PoseTable* poseTable;
} ActorPartBlueprint; // size = 0x4C

typedef struct BattleUnitKind {
	s32 mUnitType; //0x0
	char* unk_04;
    u8 field_0x8[0xC - 0x8]; //0x4
	u8 mDangerHP; //0xC
	u8 mPerilHP; //0xD
	u8 mLevel; //0xE
	u8 mBonusExp; //0xF
    s16 unk_10;
    s16 unk_12;
    s16 unk_14;
    s16 unk_16;
    s16 unk_18;
    s16 unk_1A;
    s16 unk_1C;
    s16 unk_1E;
    s32 unk_20;
    f32 unk_24;
    f32 unk_28;
    f32 unk_2C;
    f32 unk_30;
    f32 unk_34;
    f32 unk_38;
    f32 unk_3C;
    f32 unk_40;
    f32 unk_44;
    f32 unk_48;
    f32 unk_4C;
    f32 unk_50;
    f32 unk_54;
    f32 unk_58;
    f32 unk_5C;
    f32 unk_60;
    f32 unk_64;
    f32 unk_68;
    f32 unk_6C;
    f32 unk_70;
    f32 unk_74;
    f32 unk_78;
    f32 unk_7C;
    f32 unk_80;
    f32 unk_84;
    s32 unk_88;
    u8 unk_8C;
    u8 unk_8D;
    u8 unk_8E;
    u8 unk_8F;
    s32 unk_90;
    s32 unk_94;
    s32 unk_98;
    char* unk_9C;
    char* unk_A0;
    char* unk_A4;
    char* unk_A8;
    s16 unk_AC;
    s16 unk_AE;
    void* regist;
    u8 unk_B4;
    u8 unk_B5;
    u8 unk_B6;
    u8 unk_B7;
	void* mParts; //BattleWorkUnitPart*
	void* init_evt;
	DataTable* dataTable; //BattleDataEntry*
} BattleUnitKind; //sizeof 0xC4

char regist[] = {
    0x64, 0x6E, 0x64, 0x64,
    0x64, 0x64, 0x64, 0x64,
    0x64, 0x64, 0x64, 0x64,
    0x64, 0x64, 0x64, 0x6E,
    0x64, 0x64, 0x64, 0x64,
    0x64, 0x96,
};


ActorPartBlueprint parts[] = {
    {
    /*.partsTotal = */  1,
    /*.unk_04 = */       "btl_un_kuriboo",
    /*.unk_08 = */       "c_kuribo",
    /*.unk_0C = */       0x00000000,
    /*.unk_10 = */       0x00000000,
    /*.unk_14 = */       0x00000000,
    /*.unk_18 = */       0x00000000,
    /*.unk_1C = */       22.0f,
    /*.unk_20 = */       0.0f,
    /*.unk_24 = */       0.0f,
    /*.unk_28 = */       30.0f,
    /*.unk_2C = */       {0, 0, 0, 0},
    /*.targetOffset = */ {20, 30},
    /*.opacity = */      255,
    /*.unk_36 = */       {0, 0},
    /*.defenseTable = */ defence,
    /*.defenseAttr = */  defence_attr,
    /*.unk_40 = */       9,
    /*.unk_44 = */       0,
    /*.poseTable = */    pose_table,
    }
};

typedef enum BattleWeaponSpecialFlags {
	SPECIAL_UNGUARDABLE = 0x20000
} BattleWeaponSpecialFlags;

// typedef struct BattleWeapon {
// 	u8 field_0x0[0x18 - 0x0]; //0x0
// 	s8 mStylishCommandMultiplier; //0x18
// 	s8 field_0x19; //0x19
// 	s8 mBingoSlotChance; //0x1A
// 	s8 field_0x1B; //0x1B
// 	u8 field_0x1C[0x74 - 0x1C]; //0x1C
// 	BattleWeaponSpecialFlags special; //0x74
// 	u8 field_0x78[0xB0 - 0x78]; //0x78
// 	void* mAttackEvtScript; //0xB0
// 	u8 field_0xB4[0xC0 - 0xB4]; //0xB4
// } BattleWeapon; //sizeof 0xC0

typedef struct BattleWeapon {
/* 0x00 */ s32 unk_00;
/* 0x04 */ s32 unk_04;
/* 0x08 */ s32 unk_08;
/* 0x0C */ s32 unk_0C;
/* 0x10 */ u8 unk_10;
/* 0x11 */ u8 unk_11;
/* 0x12 */ u8 unk_12;
/* 0x13 */ u8 unk_13;
/* 0x14 */ f32 unk_14;
/* 0x18 */ u8 mStylishCommandMultiplier;
/* 0x19 */ u8 unk_19;
/* 0x1A */ u8 unk_1A;
/* 0x1B */ u8 unk_1B;
/* 0x1C */ void* mWeaponGetPowerDefault;
/* 0x20 */ s32 unk_20;
/* 0x24 */ s32 unk_24;
/* 0x28 */ s32 unk_28;
/* 0x2C */ s32 unk_2C;
/* 0x30 */ s32 unk_30;
/* 0x34 */ s32 unk_34;
/* 0x38 */ s32 unk_38;
/* 0x3C */ s32 unk_3C;
/* 0x40 */ s32 unk_40;
/* 0x44 */ s32 unk_44;
/* 0x48 */ s32 unk_48;
/* 0x4C */ s32 unk_4C;
/* 0x50 */ s32 unk_50;
/* 0x54 */ s32 unk_54;
/* 0x58 */ s32 unk_58;
/* 0x5C */ s32 unk_5C;
/* 0x60 */ s32 unk_60;
/* 0x64 */ u32 unk_flags1; //TODO: are these actually flags?
/* 0x68 */ u32 unk_flags2;  //TODO: are these actually flags?
/* 0x6C */ u8 unk_6C;
/* 0x6D */ u8 unk_6D;
/* 0x6E */ u8 unk_6E;
/* 0x6F */ u8 unk_6F;
/* 0x70 */ s32 unk_70;
/* 0x74 */ s32 unk_74; //tf is this
/* 0x78 */ s32 unk_78;
/* 0x7C */ u32 unk_flags3;  //TODO: are these actually flags?
/* 0x80 */ s32 unk_80;
/* 0x84 */ s32 unk_84;
/* 0x88 */ s32 unk_88;
/* 0x8C */ s32 unk_8C;
/* 0x90 */ s32 unk_90;
/* 0x94 */ s32 unk_94;
/* 0x98 */ s32 unk_98;
/* 0x9C */ s32 unk_9C;
/* 0xA0 */ s32 unk_A0;
/* 0xA4 */ s32 unk_A4;
/* 0xA8 */ s32 unk_A8;
/* 0xAC */ s32 unk_AC;
/* 0xB0 */ s32 unk_B0;
/* 0xB4 */ u8 unk_B4;
/* 0xB5 */ u8 unk_B5;
/* 0xB6 */ u8 unk_B6;
/* 0xB7 */ u8 unk_B7;
/* 0xB8 */ s32 unk_B8;
/* 0xBC */ s32 unk_BC;
} BattleWeapon; //sizeof 0xC0

s32 weaponGetPowerDefault(void); //unsure on signature

BattleWeapon weapon_tik_kuriboo_attack = {
/*.unk_00 = */       0x00000000,
/*.unk_04 = */       0x00000000,
/*.unk_08 = */       0x00000000,
/*.unk_0C = */       0x00000000,
/*.unk_10 = */       100,
/*.unk_11 = */       0,
/*.unk_12 = */       0,
/*.unk_13 = */       1,
/*.unk_14 = */       1.0f,
/*.unk_18 = */       1,
/*.unk_19 = */       1,
/*.unk_1A = */       1,
/*.unk_1B = */       1,
/*.unk_1C = */       weaponGetPowerDefault,
/*.unk_20 = */       0x00000001,
/*.unk_24 = */       0x00000000,
/*.unk_28 = */       0x00000000,
/*.unk_2C = */       0x00000000,
/*.unk_30 = */       0x00000000,
/*.unk_34 = */       0x00000000,
/*.unk_38 = */       0x00000000,
/*.unk_3C = */       0x00000000,
/*.unk_40 = */       0x00000000,
/*.unk_44 = */       0x00000000,
/*.unk_48 = */       0x00000000,
/*.unk_4C = */       0x00000000,
/*.unk_50 = */       0x00000000,
